Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/legislative/index.html.txt.tmx
Source language: en
Languages: ga

source: Legislation applying to broken engagements
ga: Cúlra reachtach: Rochtain ar fhaisnéis comhshaoil

source: The law governs disputes between a couple whose engagement ends
ga: Legislative background for accessing environmental information from a public authority

source: Legislative background for accessing environmental information
ga: Reachtaíocht i bhfeidhm maidir le gealltanais teipthe

source: Legislative background for accessing environmental information from a public authority
ga: Rialaíonn an dlí aighnis idir lánúin a bhfuil deireadh tagtha lena ngealltanas

source: Most Read in "Reference"
ga: Ábhar is mó éilimh i "Reference"

source: At what age can I?
ga: Cén aois is féidir liom?

source: Case study: Calculating your income tax
ga: Cás-staidéar: Do cháin ioncaim a ríomh

source: Checklist when applying for Jobseeker's Allowance
ga: Seicliosta nuair atá iarratas á dhéanamh ar Liúntas Cuardaitheora Poist
